{
    "title":"Recent Projects",
    "desc":"This is work that I've done during my years as a computer science student",
    "entries":
    [
{"label": "This Portfolio App", "content": "I decided it would be a good idea to have all my work in one place where people can see it easily. It's relatively simple, I'd like to believe it's elegant, and it demonstrates that I am capable of web application development. It uses node.js with the Jade engine and Bootstrap for rendering.", "link":"https://github.com/unarmed1618/portfolio", "linkdesc":"Check it out!"},
{"label": "PirateGolf Solution", "content": "A work in progress, this is the application that my team is developing for the second half of our capstone course in Software Engineering. The purpose of the project is to develop a digital scorecard tool for my university's golf team. Our intention is to develop a mobile application as a frontend that will push queries to the node.js/postgres backend.","link":"https://github.com/unarmed1618/pirategolf","linkdesc":"Check it out!"},
{"label": "BlackWhite NPC Designer App", "content": "A few months ago, I approached a man named James Covenant who is developing a game, and asked him if there was anything I could do to get involved. He told me he needed an application by which his supporters and friends could create sprites (Animated Images of Characters) for the engine he is building using Stencyl. I developed an application for him in Java. It uses swing/awt for graphics and painting, and creates a PNG sprite-map that can be imported directly into Stencyl. Although I can't provide a copy of the app, I can link you to his page. ", "link":"http://jamescovenant.tumblr.com","linkdesc":"Have a look!"},
{"label": "ChartreuseBoard", "content": "Last semester, for the 1st half of my capstone class, I and my team were tasked with creating a Learning Management System based on the popular Blackboard. We developed something similar, leveraging Asp.net and MySQL. The project was appropriated by the University for record keeping.","link":"/", "linkdesc":"Home"},
{"label": "Google Glass - Conversational Translation", "content": "Last semester, I started work on this ongoing project. My intention is to develop an application whereby two Google Glass users can have a conversation in two different languages, but get subtitles on their personal screen and be able to understand each other. It is an extremely ambitious application, and if/when I have the money for it, I'd like to get more developers on the project.", "link":"/","linkdesc":"Home"},
{"label": "Google Glass - ReadAlong App", "content": "This is another work in progress application, leveraging optical character recognition, text-to-speech, speech-to-text, and the online dictionary belonging to Google. The purpose of this application is to create an application that can act as a reading coach for children. While holding a book in view, a child can read aloud the words and if they stumble, this application would catch and read the word, and define it if necessary. This application can also be used for tracking learning and educational effectiveness.", "link":"/", "linkdesc":"Home"},
{"label": "NSF Grant Research", "content": " Last Summer, I recieved a grant award from the government for the purposes of learning about software testing and professional research. My project was of my own devising, a method of testing and improving Adaptive Learning software by integrating Electroencephalography (EEG) technology to create a Brain-Computer interface. My summary paper about my work on this is linked here.", "link":"/AdaptPaper", "linkdesc":"Read it."},
{"label": "Planet Burn", "content": " Last Year, I very unsuccessfully attempted to kickstart a video game called Planet Burn. The game was based around the concept of complete intercompatibility of objects. For instance, in this game, you were supposed to survive, but you could use anything around you to do it. You could build a gun out of car parts for instance. This mechanic has since been seen in games like Dead Rising and Seven Days to Die. The game itself, or rather, the tech demo that I completed before it became apparent that there was insufficient interest on the Kickstarter Community for the game, is written using the Unity3d Game Engine. It was certainly a learning experience for me, and if I ever have the time and resources, I would like to finish the game and try to release it anyway. Here is a link to the kickstarter page.", "link":"https://www.kickstarter.com/projects/328777376/planet-burn-alpha", "linkdesc":"Have a look."},
{"label": "Independent Study: Game Design", "content": " Last Year, I signed up for an independent study class for which I and an Animation student worked on developing a video game for a semester. We made significant progress, and learned a lot. We overplanned the game, though, and ended up giving ourselves far more work than we were capable of. The premise of the game was that you are trapped in a library where each of the floors going downward is more bizarre and frightening. The floors would be themed after the levels of Hell described in Dante's Inferno. In the end, we developed a first and second floor effectively, and created sufficient gimmicks to give the protagonist a fighting chance at defeating enemies by swinging her sword.", "link": "/", "linkdesc": "Home"}
    ]
}
